### Question 1

Consider the given NumPy arrays a and b. What will be the value of c after the following code is executed?

In [52]:
import numpy as np
import pandas as pd

a = np.arange(8)
b = a[4:6]
print(b)
b[:] = 40
print(b)
c = a[4] + a[6]
c

# since b is a view of a, changing b will change a

[4 5]
[40 40]

46

In [53]:
# to avoid this, use copy
d = a[4:6].copy()

### Question 2

Given the string s as shown below, which of the following expressions will be True?

In [54]:
import re
s = 'ABCAC'

In [55]:
re.match('A', s) == True # <re.Match object; span=(0, 1), match='A'>

False

In [56]:
bool(re.match('A', s)) == True

True

In [57]:
#len(re.search('A', s)) == 2 object of type 're.Match' has no len()

re.search('A', s)

In [58]:
len(re.split('A', s)) == 2

False

### Question 3

Consider a string s. We want to find all characters (other than A) which are followed by triple A, i.e., have AAA to the right. We don’t want to include the triple A in the output and just want the character immediately preceding AAA . Complete the code given below that would output the required result.

In [59]:
def result():
    s = 'ACAABAACAAABACDBADDDFSDDDFFSSSASDAFAAACBAAAFASD'

    result = []
    # compete the pattern below
    #    - '.' matches any character except newline
    #    - '(?=AAA)' is a positive lookahead assertion that matches 'AAA' without including it in the result
    pattern = '.(?=AAA)'
    for item in re.finditer(pattern, s):
      # identify the group number below.
      result.append(item.group())
      
    return result

result()

['C', 'F', 'B']

## Question 4

Consider the following 4 expressions regarding the above pandas Series df. All of them have the same value except one expression. Can you identify which one it is?

In [60]:
df = pd.Series((4, 7, -5, 3), index = ['d', 'b', 'a', 'c'] )

print(df)
df['d']

d    4
b    7
a   -5
c    3
dtype: int64

4

In [61]:
print(df.index[0])
print(df.iloc[0])
print(df['d'])
print(df[0])

d
4
4
4

## Question 5

Consider the two pandas Series objects shown above, representing the no. of items of different yogurt flavors that were sold in a day from two different stores, s1 and s2. Which of the following statements is True regarding the Series s3 defined below?

In [62]:
s1 = pd.Series({'Mango': 20, 'Strawberry': 15, 'Blueberry': 18, 'Vanilla': 31})
s2 = pd.Series({'Strawberry': 20, 'Vanilla': 30, 'Banana': 15, 'Mango': 20, 'Plain': 20})
s3 = s1.add(s2)
s3

Banana         NaN
Blueberry      NaN
Mango         40.0
Plain          NaN
Strawberry    35.0
Vanilla       61.0
dtype: float64

In [63]:
s3['Plain'] >= s3['Mango']

False

In [64]:
s3['Mango'] >=  s1.add(s2, fill_value = 0)['Mango']

True

In [65]:
s3['Blueberry'] == s1.add(s2, fill_value = 0)['Blueberry']

False

In [66]:
s3['Blueberry'] == s1['Blueberry']

False

## Question 7

Consider the Series object S defined below. Which of the following is an incorrect way to slice S such that we obtain all data points corresponding to the indices 'b', 'c', and 'd'?

In [67]:
S = pd.Series(np.arange(5), index=['a', 'b', 'c', 'd', 'e'])

In [68]:
S['b':'e']

b    1
c    2
d    3
e    4
dtype: int32

In [69]:
S[['b', 'c', 'd']]

b    1
c    2
d    3
dtype: int32

In [70]:
S[S <= 3][S > 0]

b    1
c    2
d    3
dtype: int32

In [71]:
S[1:4]

b    1
c    2
d    3
dtype: int32

## Question 8
Consider the DataFrame df shown above with indexes 'R1', 'R2', 'R3', and 'R4'.  In the following code, a new DataFrame df_new is created using df. What will be the value of df_new[1] after the below code is executed?

In [72]:

df = pd.DataFrame({'a' : [5, 5, 71, 67], 'b' : [6, 82, 31, 37], 'c' : [20, 28, 92, 49]}, index = ['R1', 'R2', 'R3', 'R4'])
df

     a   b   c
R1   5   6  20
R2   5  82  28
R3  71  31  92
R4  67  37  49

In [73]:
f = lambda x: x.max() + x.min()
df_new = df.apply(f) # apply function f to each column. Axis = 0 is default. If axis = 1, apply function to each row
df_new

a     76
b     88
c    112
dtype: int64

In [74]:
df_new[1]

88

## Question 9
Consider the DataFrame named new_df shown above. Which of the following expressions will output the result (showing the head of a DataFrame) below?

In [75]:
df = pd.read_csv("cwurData.csv")
df.head()

,world_rank,institution,country,national_rank,quality_of_education,alumni_employment,quality_of_faculty,publications,influence,citations,broad_impact,patents,score,year
0,1,Harvard University,USA,1,7,9,1,1,1,1,NaN,5,100.00,2012
1,2,Massachusetts Institute of Technology,USA,2,9,17,3,12,4,4,NaN,1,91.67,2012
2,3,Stanford University,USA,3,17,11,5,4,2,2,NaN,15,89.50,2012
3,4,University of Cambridge,United Kingdom,1,10,24,4,16,16,11,NaN,50,86.17,2012
4,5,California Institute of Technology,USA,4,2,29,7,37,22,22,NaN,18,85.21,2012

In [76]:
#creating a new column called Rank_Level, which categorizes universities into four groups based on their ranking:

def set_rank(row):
    if row["world_rank"] <= 100:
        return "first tier top university"
    elif row["world_rank"] <= 200:
        return "second tier top university"
    elif row["world_rank"] <= 300:
        return "third tier top university"
    return "other top university"

df["rank level"] = df.apply(set_rank, axis=1)

df

,world_rank,institution,country,national_rank,quality_of_education,alumni_employment,quality_of_faculty,publications,influence,citations,broad_impact,patents,score,year,rank level
0,1,Harvard University,USA,1,7,9,1,1,1,1,NaN,5,100.00,2012,first tier top university
1,2,Massachusetts Institute of Technology,USA,2,9,17,3,12,4,4,NaN,1,91.67,2012,first tier top university
2,3,Stanford University,USA,3,17,11,5,4,2,2,NaN,15,89.50,2012,first tier top university
3,4,University of Cambridge,United Kingdom,1,10,24,4,16,16,11,NaN,50,86.17,2012,first tier top university
4,5,California Institute of Technology,USA,4,2,29,7,37,22,22,NaN,18,85.21,2012,first tier top university
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
2195,996,University of the Algarve,Portugal,7,367,567,218,926,845,812,969.0,816,44.03,2015,other top university
2196,997,Alexandria University,Egypt,4,236,566,218,997,908,645,981.0,871,44.03,2015,other top university
2197,998,Federal University of Ceará,Brazil,18,367,549,218,830,823,812,975.0,824,44.03,2015,other top university
2198,999,University of A Coruña,Spain,40,367,567,218,886,974,812,975.0,651,44.02,2015,other top university
2199,1000,China Pharmaceutical University,China,83,367,567,218,861,991,812,981.0,547,44.02,2015,other top university

In [77]:
# Instructor's solution

def create_category(ranking):
    # Since the rank is just an integer, I'll just do a bunch of if/elif statements
    if (ranking >= 1) & (ranking <= 100):
        return "First Tier Top Unversity"
    elif (ranking >= 101) & (ranking <= 200):
        return "Second Tier Top Unversity"
    elif (ranking >= 201) & (ranking <= 300):
        return "Third Tier Top Unversity"
    return "Other Top Unversity"

# Now we can apply this to a single column of data to create a new series
df['Rank_Level'] = df['world_rank'].apply(lambda x: create_category(x))
# And lets look at the result
df.head()

,world_rank,institution,country,national_rank,quality_of_education,alumni_employment,quality_of_faculty,publications,influence,citations,broad_impact,patents,score,year,rank level,Rank_Level
0,1,Harvard University,USA,1,7,9,1,1,1,1,NaN,5,100.00,2012,first tier top university,First Tier Top Unversity
1,2,Massachusetts Institute of Technology,USA,2,9,17,3,12,4,4,NaN,1,91.67,2012,first tier top university,First Tier Top Unversity
2,3,Stanford University,USA,3,17,11,5,4,2,2,NaN,15,89.50,2012,first tier top university,First Tier Top Unversity
3,4,University of Cambridge,United Kingdom,1,10,24,4,16,16,11,NaN,50,86.17,2012,first tier top university,First Tier Top Unversity
4,5,California Institute of Technology,USA,4,2,29,7,37,22,22,NaN,18,85.21,2012,first tier top university,First Tier Top Unversity

In [78]:
new_df = df.pivot_table(values='score', index='country', columns='Rank_Level', aggfunc=[np.mean, np.max]).head()
new_df

                               mean                      \
Rank_Level First Tier Top Unversity Other Top Unversity
country
Argentina                       NaN           44.672857
Australia                   47.9425           44.645750
Austria                         NaN           44.864286
Belgium                     51.8750           45.081000
Brazil                          NaN           44.499706

                                                               \
Rank_Level Second Tier Top Unversity Third Tier Top Unversity
country
Argentina                        NaN                      NaN
Australia                    49.2425                47.285000
Austria                          NaN                47.066667
Belgium                      49.0840                46.746667
Brazil                       49.5650                      NaN

                               amax                      \
Rank_Level First Tier Top Unversity Other Top Unversity
country
Argentina                       NaN               45.66
Australia                     51.61               45.97
Austria                         NaN               46.29
Belgium                       52.03               46.21
Brazil                          NaN               46.08


Rank_Level Second Tier Top Unversity Third Tier Top Unversity
country
Argentina                        NaN                      NaN
Australia                      50.40                    47.47
Austria                          NaN                    47.78
Belgium                        49.73                    47.14
Brazil                         49.82                      NaN

In [79]:
new_df.stack()

                                          mean   amax
country   Rank_Level
Argentina Other Top Unversity        44.672857  45.66
Australia First Tier Top Unversity   47.942500  51.61
          Other Top Unversity        44.645750  45.97
          Second Tier Top Unversity  49.242500  50.40
          Third Tier Top Unversity   47.285000  47.47
Austria   Other Top Unversity        44.864286  46.29
          Third Tier Top Unversity   47.066667  47.78
Belgium   First Tier Top Unversity   51.875000  52.03
          Other Top Unversity        45.081000  46.21
          Second Tier Top Unversity  49.084000  49.73
          Third Tier Top Unversity   46.746667  47.14
Brazil    Other Top Unversity        44.499706  46.08
          Second Tier Top Unversity  49.565000  49.82

In [80]:
new_df.unstack()

      Rank_Level                 country
mean  First Tier Top Unversity   Argentina          NaN
                                 Australia    47.942500
                                 Austria            NaN
                                 Belgium      51.875000
                                 Brazil             NaN
      Other Top Unversity        Argentina    44.672857
                                 Australia    44.645750
                                 Austria      44.864286
                                 Belgium      45.081000
                                 Brazil       44.499706
      Second Tier Top Unversity  Argentina          NaN
                                 Australia    49.242500
                                 Austria            NaN
                                 Belgium      49.084000
                                 Brazil       49.565000
      Third Tier Top Unversity   Argentina          NaN
                                 Australia    47.285000
                                 Austria      47.066667
                                 Belgium      46.746667
                                 Brazil             NaN
amax  First Tier Top Unversity   Argentina          NaN
                                 Australia    51.610000
                                 Austria            NaN
                                 Belgium      52.030000
                                 Brazil             NaN
      Other Top Unversity        Argentina    45.660000
                                 Australia    45.970000
                                 Austria      46.290000
                                 Belgium      46.210000
                                 Brazil       46.080000
      Second Tier Top Unversity  Argentina          NaN
                                 Australia    50.400000
                                 Austria            NaN
                                 Belgium      49.730000
                                 Brazil       49.820000
      Third Tier Top Unversity   Argentina          NaN
                                 Australia    47.470000
                                 Austria      47.780000
                                 Belgium      47.140000
                                 Brazil             NaN
dtype: float64

In [81]:
new_df.stack().stack()

country    Rank_Level
Argentina  Other Top Unversity        mean    44.672857
                                      amax    45.660000
Australia  First Tier Top Unversity   mean    47.942500
                                      amax    51.610000
           Other Top Unversity        mean    44.645750
                                      amax    45.970000
           Second Tier Top Unversity  mean    49.242500
                                      amax    50.400000
           Third Tier Top Unversity   mean    47.285000
                                      amax    47.470000
Austria    Other Top Unversity        mean    44.864286
                                      amax    46.290000
           Third Tier Top Unversity   mean    47.066667
                                      amax    47.780000
Belgium    First Tier Top Unversity   mean    51.875000
                                      amax    52.030000
           Other Top Unversity        mean    45.081000
                                      amax    46.210000
           Second Tier Top Unversity  mean    49.084000
                                      amax    49.730000
           Third Tier Top Unversity   mean    46.746667
                                      amax    47.140000
Brazil     Other Top Unversity        mean    44.499706
                                      amax    46.080000
           Second Tier Top Unversity  mean    49.565000
                                      amax    49.820000
dtype: float64

In [82]:
new_df.unstack().unstack()

country                         Argentina  Australia    Austria    Belgium  \
     Rank_Level
mean First Tier Top Unversity         NaN   47.94250        NaN  51.875000
     Other Top Unversity        44.672857   44.64575  44.864286  45.081000
     Second Tier Top Unversity        NaN   49.24250        NaN  49.084000
     Third Tier Top Unversity         NaN   47.28500  47.066667  46.746667
amax First Tier Top Unversity         NaN   51.61000        NaN  52.030000
     Other Top Unversity        45.660000   45.97000  46.290000  46.210000
     Second Tier Top Unversity        NaN   50.40000        NaN  49.730000
     Third Tier Top Unversity         NaN   47.47000  47.780000  47.140000

country                            Brazil
     Rank_Level
mean First Tier Top Unversity         NaN
     Other Top Unversity        44.499706
     Second Tier Top Unversity  49.565000
     Third Tier Top Unversity         NaN
amax First Tier Top Unversity         NaN
     Other Top Unversity        46.080000
     Second Tier Top Unversity  49.820000
     Third Tier Top Unversity         NaN

## Question 10

Consider the DataFrame df shown above. What will be the output (rounded to the nearest integer) when the following code related to df is executed:

In [83]:
# dataframe with columns item, store and quantity sold
df = pd.DataFrame({'Item': ['item_1', 'item_1', 'item_1', 'item_2', 'item_2', 'item_2'], 'Store': ['A', 'B', 'C', 'A', 'B', 'C'], 'Quantity sold': [10.0, 20.0, np.nan, 5.0, 10.0, 15.0]})

In [84]:
df.groupby('Item').sum().iloc[0]['Quantity sold']

30.0